{
    "basic": {
        "name": "Jesus Francisco Cruz",
        "job": "Desarrollador Full Stack",
        "summary": "Ingeniero en computación dispuesto en aprender nuevas tecnologías y mejorar mis habilidades. Me apasiona el desarrollo de software y disfruto trabajando en proyectos desafiantes que requieren soluciones innovadoras.",
        "cv_file_name": "Jesus_cv.pdf"
    },
    "experiences": [
        {
            "title": "Analista de sistemas administrador de aplicaciones",
            "sub_title": " Grupo Financiero Inbursa.",
            "years": "Febrero 2025 - Abril 2025",
            "details": "Resolví más de 150 incidencias en servidores de producción, brindando soporte técnico en entornos Linux y Windows. Utilicé herramientas como WebLogic, IIS y Flux para diagnóstico y recuperación, manteniendo contacto directo con usuarios y escalando casos críticos a las áreas correspondientes. Documenté y gestioné los casos en Jira, analicé configuraciones (.yaml, application.properties) y extraje logs con FileZilla para asegurar una atención oportuna y efectiva."
        },
        {
            "title": "Auxiliar en gerencia de servicios digitales",
            "sub_title": "Corporativo PEMEX",
            "years": "Julio 2024 - Enero 2025",
            "details": "Llevé a cabo la instalación y configuración de servidores y clientes de monitoreo en entornos productivos de PEMEX, desarrollando scripts en Linux para automatizar procesos clave. Las configuraciones implementadas permitieron el envío oportuno de reportes por correo electrónico, los cuales continúan en uso actualmente. Además, actualicé y di mantenimiento a software crítico, garantizando la operatividad continua del sistema."
        }
    ],
    "education": [
        {
            "title": "Desarrollador Java Full Stack",
            "sub_title": "Generation México",
            "years": "Mayo 2025 - Agosto 2025",
            "details": "Graduado con honores. Especializado en desarrollo de software. Trabajé en varios proyectos que ayudaron en mi formación como desarrollador Java Full Stack."
        },
        {
            "title": "Ingeniería en Computación",
            "sub_title": "Ingeniería en Computación, IPN ESIME Culhuacan",
            "years": "Septiembre 2020 - Julio 2024",
            "details": "Enfocado en algoritmos avanzados, computación en la nube y desarrollo full-stack. Publicó artículos de investigación sobre arquitectura de microservicios escalables."
        }
    ],
    "projects": [
        {
            "title": "Net-Shopping",
            "sub_title": "E-commerce",
            "years": "Mayo 2025 - Agosto 2025",
            "details": "Desarrollo de una plataforma e-commerce colaborativa aplicando la metodología ágil SCRUM. Participación activa en la programación con Java, JavaScript, HTML5, CSS y Bootstrap, uso de bases de datos relacionales, y gestión del código fuente mediante Git/GitHub. Enfocado en buenas prácticas de desarrollo, trabajo en equipo y control de versiones."
        
        },
        {
            "title": "Sistema de Acceso controlado con 2FA de Audio Digital",
            "sub_title": "Sistema computacional",
            "years": "Junio 2023 - Junio 2024",
            "details": "Desarrollo de un sistema de autenticación de dos factores basado en audio, utilizando la técnica esteganográfica LSB para la inserción del NIP. Implementado en MATLAB y Audacity para el procesamiento de audio. "
        
        },
        {
            "title": "Punto de Venta de Uniformes",
            "sub_title": "Sistema computacional",
            "years": "Octubre 2023 - Enero 2024",
            "details": "Desarrollo de una base de datos con interfaz gráfica en Java NetBeans para el registro y gestión de clientes, ventas y productos, utilizando MySQL."
        
        }
    ],
    "contacto": [
        {
            "title": "Correo Electrónico: ",
            "sub_title": "cruz.ramirez.jesus.francisco@gmail.com",
            "years": "",
            "details": "Puedes contactarme a través de mi correo electrónico para cualquier consulta o colaboración. Estoy siempre abierto a nuevas oportunidades y proyectos interesantes."
        
        }
    ],
    "menuItems": [
        {
            "name": "Acerca de",
            "link": "/"
        },
        {
            "name": "Sobtre mí",
            "link": "/blogs"
        }
    ],
    "socialLinks": [
        {
            "iconName": "Github",
            "link": "https://github.com/JesusFranciscoCruz"
        },
        {
            "iconName": "linkedin2",
            "link": "https://www.linkedin.com/in/ing-jes%C3%BAs-fco-cruz"
        }
    ]
}